clear all;
close all;
movs={'указ_Андрей_Л_1мин_день1.log','сред_Андрей_Л_1мин_день1.log','безим_Андрей_Л_1мин_день1.log','миз_Андрей_Л_1мин_день1.log','сжим_Андрей_Л_1мин_день1.log','разжим_Андрей_Л_1мин_день1.log','щелч_Андрей_Л_1мин_день1.log';
    'указ_Андрей_Л_1мин_день2.log','сред_Андрей_Л_1мин_день2.log','безим_Андрей_Л_1мин_день2.log','миз_Андрей_Л_1мин_день2.log','сжим_Андрей_Л_1мин_день2.log','разжим_Андрей_Л_1мин_день2.log','щелч_Андрей_Л_1мин_день2.log';
    'указ_Андрей_Л_1мин_день3.log','сред_Андрей_Л_1мин_день3.log','безим_Андрей_Л_1мин_день3.log','миз_Андрей_Л_1мин_день3.log','сжим_Андрей_Л_1мин_день3.log','разжим_Андрей_Л_1мин_день3.log','щелч_Андрей_Л_1мин_день3.log';
    'указ_Андрей_Л_1мин_день4.log','сред_Андрей_Л_1мин_день4.log','безим_Андрей_Л_1мин_день4.log','миз_Андрей_Л_1мин_день4.log','сжим_Андрей_Л_1мин_день4.log','разжим_Андрей_Л_1мин_день4.log','щелч_Андрей_Л_1мин_день4.log';
    'указ_Андрей_Л_1мин_день5.log','сред_Андрей_Л_1мин_день5.log','безим_Андрей_Л_1мин_день5.log','миз_Андрей_Л_1мин_день5.log','сжим_Андрей_Л_1мин_день5.log','разжим_Андрей_Л_1мин_день5.log','щелч_Андрей_Л_1мин_день5.log';
    'указ_Андрей_Л_1мин_день6.log','сред_Андрей_Л_1мин_день6.log','безим_Андрей_Л_1мин_день6.log','миз_Андрей_Л_1мин_день6.log','сжим_Андрей_Л_1мин_день6.log','разжим_Андрей_Л_1мин_день6.log','щелч_Андрей_Л_1мин_день6.log';
    'указ_Андрей_Л_1мин_день7.log','сред_Андрей_Л_1мин_день7.log','безим_Андрей_Л_1мин_день7.log','миз_Андрей_Л_1мин_день7.log','сжим_Андрей_Л_1мин_день7.log','разжим_Андрей_Л_1мин_день7.log','щелч_Андрей_Л_1мин_день7.log';
    'указ_Андрей_Л_1мин_день8.log','сред_Андрей_Л_1мин_день8.log','безим_Андрей_Л_1мин_день8.log','миз_Андрей_Л_1мин_день8.log','сжим_Андрей_Л_1мин_день8.log','разжим_Андрей_Л_1мин_день8.log','щелч_Андрей_Л_1мин_день8.log';
    'указ_Андрей_Л_1мин_день9.log','сред_Андрей_Л_1мин_день9.log','безим_Андрей_Л_1мин_день9.log','миз_Андрей_Л_1мин_день9.log','сжим_Андрей_Л_1мин_день9.log','разжим_Андрей_Л_1мин_день9.log','щелч_Андрей_Л_1мин_день9.log';
    'указ_Андрей_Л_1мин_день10.log','сред_Андрей_Л_1мин_день10.log','безим_Андрей_Л_1мин_день10.log','миз_Андрей_Л_1мин_день10.log','сжим_Андрей_Л_1мин_день10.log','разжим_Андрей_Л_1мин_день10.log','щелч_Андрей_Л_1мин_день10.log';
    'указ_Андрей_Л_1мин_день11.log','сред_Андрей_Л_1мин_день11.log','безим_Андрей_Л_1мин_день11.log','миз_Андрей_Л_1мин_день11.log','сжим_Андрей_Л_1мин_день11.log','разжим_Андрей_Л_1мин_день11.log','щелч_Андрей_Л_1мин_день11.log';
    'указ_Андрей_Л_1мин_день12.log','сред_Андрей_Л_1мин_день12.log','безим_Андрей_Л_1мин_день12.log','миз_Андрей_Л_1мин_день12.log','сжим_Андрей_Л_1мин_день12.log','разжим_Андрей_Л_1мин_день12.log','щелч_Андрей_Л_1мин_день12.log';
    'указ_Андрей_Л_1мин_день13.log','сред_Андрей_Л_1мин_день13.log','безим_Андрей_Л_1мин_день13.log','миз_Андрей_Л_1мин_день13.log','сжим_Андрей_Л_1мин_день13.log','разжим_Андрей_Л_1мин_день13.log','щелч_Андрей_Л_1мин_день13.log'};

%cd 'данные эмг';

%load('bandstop_50.mat')
days = 13;
num_mov = 7;
data_len = 54200;
for str=1:days
    for col=1:num_mov
        %f = fopen('щелч_Андрей_Л_1мин_день4.log','r') ;
        f = fopen(movs{str,col}(1,:),'r') ;
        numPacket = 1;
        cnt_pkt=1;
        %while(~feof(f))
        while(cnt_pkt<=data_len)
            sync1 = fread(f,1,'uint8') ;
            if sync1~=hex2dec('A5')
                continue ;
            end
            if feof(f)
                break ;
            end
            sync2 = fread(f,1,'uint8') ;
            if sync2~=hex2dec('5A')
                continue ;
            end
            if feof(f)
                break ;
            end
            pktCount(cnt_pkt) = fread(f,1,'uint8') ;
            cnt_pkt = cnt_pkt + 1;
            if feof(f)
                break ;
            end
            value = fread(f,1,'uint16','ieee-be') ;

            %value = fread(f,1,'int') ;
            val10 = value ;
            if feof(f)
                break ;
            end
            %   if value<1024
            %      val10 = value ;
            %   else
            %      fprintf('Error:\n%4X %d %d\n', value, value, val10) ;
            %      formatError = 1 ;
            %      break ;
            %   end
            data(numPacket) = val10 ;
            numPacket = numPacket + 1;
        end
        data=data(1:data_len);
        fclose(f);
        fprintf('движ = %d ; день= %d \n',col,str)
        figure;plot(data);
        seven_movs_one_min{str,1}(col,1:length(data)) = data;
    end
end
%fclose(f);
out_filt_data=conv(data,bandstop_50,'same');
figure;plot(data);
figure;plot(out_filt_data);